app/controllers/chatroom_controller.rb

  def show
    chat = ChatRoom.find(params[:id])
---
SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def message
    user = User.find(@current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]