app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "q"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "q"], ["password_digest", "$2a$10$E5qVM0Pep5IjEkK2Oh95wugSWPIHe1EHziDjf6ZSwk5ReOTZHYxkq"], ["created_at", 2016-12-29 02:32:42 UTC], ["updated_at", 2016-12-29 02:32:42 UTC]]
---
  def create
    if User.find_by_email(params[:email])
      render json: { error: "User already exist", status: 422 }, status: 422
    else
      User.create(email: params[:email], password: params[:password])